# GridlinesOverlap Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainWallFailures..::..GridlinesOverlap Property
BuiltInFailures..::..CurtainWallFailures Class See Also
---
Overlapping gridlines should be avoided, unless there are only two and one is host type dependent and the other is not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId GridlinesOverlap { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GridlinesOverlap As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ GridlinesOverlap {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainWallFailures Class
Autodesk.Revit.DB Namespace